# დავალება:
# შექმენით ფუნქცია რომელსაც გადაეცემა 3 პარამეტრი(სამკუთხედის გვერდები) 
# და დაპრინტავს "ასეთი სამკუთხედი იარსებებს", 
# ან დაპრინტავს "ასეთი სამკუთხედი ვერ იარსებებს" )


# შექმენით ფუნქცია რომელსაც გადაეცემა სამი სახელი (სამი პარამეტრი) და დაპრინტავს ამ სახელებისგან სიას ( join ან split) გაიხსენეთ


# სამკუთხედის_შიგა_კუთხეების_ჯამი = 180
# x = სამკუთხედის_შიგა_კუთხეების_ჯამი

# if x == 180:
#     print("ასეთი სამკუთხედი იარსებებს")
# elif x != 180:
#     print("ასეთი სამკუთხედი ვერ იარსებებს")
# else:
#     print("ყველა ვარიათში სამკუთხედის შიგა კუუთხეების ჯამი 180 უნდა იყოს")


names = ", ".join(list(["dati", "datuna", "datiko"]))
print(names)


