#print("this is the first line")
print("hello, world!")

#print("this is the third line")
print("python magaria")

# ეს დაიპრინტება ორჯერ, რადგან ორჯერ არის დაწერილი პრინტი 


#2

spam = 7
if spam > 5:
    print("five")
if spam >8:
    print("eight")

# აქ დაიპრინტება ხუთი, ანუ five რადგან სპამი უდრის შვიდს და პირველ მაგალითში რომ წერია, თუ შვიდი მეტია ხუთზე, მაშინ დაიპრინტოს ხუთიო, და დაიპრინტება კიდევაც რადგან 7ი მეტია ხუთზე, 
# და მეორეშ სადაც წერია, რომ თუ 7ი მეტია რვაზე, დაიპრინტოს რვაო, არ დაიპრინტება რადგან შვიდი ნაკლბია რვაზე.

#3

x = 5
print(type(x))

y = 5.0
print(type(y))

#ამ შემთხევაშო დაიპრინტება, int და float რადგან ინტი არის მთელი რიცხვი, და ფლოათი არის ათ წილადი.

#4

a = "nika 11 keshelava"
print(len(a))

# ამ მაგალითში წერია ლენ რომელიც ითვლის სიგრძეს, ნიკა კეშელავა კი შედგება 15 ასოსგან, მარა რადგან სფეისებიც ითვლება ანუ სიგრძე = 17.

#5

for x in "ban  ana":
    print(x)

#ამ მაგალითში გვეკითხებიან რამდენჯერ დაიპრიტებაო, და თან ორი სფეისია შუაშიო, რადგან ვიცით რომ სფეისებიც უნდა დავთალოთ, ესეიგი ეს მაგალითი დაიპრინტება 8-ჯერ.


#5

my_str = "nika 11 keshelava"
print(my_str[5]+my_str[6]+"4")

#გვეკითხებიან რა იქნება ამ მაგალითი შედეგიო, რადგნა ათვლა იწყება ნულიდან, ესეგი [5]იქნება 1 და [6]იც იქნება ერთი, ანუ თერთმეტი, და ამას დამატებული 4 გამოვა 114, აქ არ გვთხოვენ ჯამის დათვლას.

#6

a = "hello, world"
print(a[3] + a[5])

#გვეკითხებიან რა დაიპრიტებაო აქ დაიპრიტება I, რადგან როგროც წინ ამაგლითში დავწერე ათვლა იწყება 0 დან და ესეიგი გამოვა რომ ეს მაგალითი დაპრინტავს (I,).


#7

#რამდენჯერ იმუშავებს ეს კოდი:

for i in range(1, 20, 3):
    print(i)


# ეს კოდი იმუშავებს, 7-ჯერ რადგნა აქ არის მოცემული, რომ 20-ში რამდენჯერ ჩაეტევა ყოველ მიღებულ რიცხვს დამატებული სამი, მაგ:1, 4, 7, 10, 13, 16, 19 ამიტომ დაპრიტავს 7ს.




